Revit 2017 API
RevitLinkUIUtils.ReportLinkLoadResults Method
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public static void ReportLinkLoadResults(
	Document doc,
	IDictionary<string, RevitLinkLoadResult> loadResults
)
Visual Basic
Public Shared Sub ReportLinkLoadResults ( _
	doc As Document, _
	loadResults As IDictionary(Of String, RevitLinkLoadResult) _
)
Visual C++
public:
static void ReportLinkLoadResults(
	Document^ doc,
	IDictionary<String^, RevitLinkLoadResult^>^ loadResults
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
loadResults
Type: System.Collections.Generic.IDictionary<String, RevitLinkLoadResult>
See Also
RevitLinkUIUtils Class
Autodesk.Revit.UI Namespace